# 1) მიიყვანეთ ჯგუფური პროექტები საბოლოო ეტაპამდე

# 2) შექმენით ფუნქცია რომელსაც არგუმენტად ინტეჯერების სიას და მომხმარებლის პასუხს გადასცემთ. მომხმარებელს აარჩევინეთ ამ სიიდან ერთ-ერთი რიცხვი და დათვალეთ თუ რამდენჯერ მეორდება ეს რიცხვი სიაში.

# 3) შექმენით ფუნქცია, რომელსაც გადასცემთ 2 არგუმენტს: სია, მომხმარებლის პასუხი. ფუნქციის მიხედვით მომხმარებელს ჰკითხე სურს თუ არა სიის გასუფთავება. თუ დაგთანხმდება გაასუფთავე სია თუ არა მაშინ ჩვეულებრივად გამოიტანე ეს სია ტერმინალში.

# 4) შექმენით სია სახელად Fruits და ჩაამატეთ მასში ხილი. მომხმარებელს შემოატანინეთ ინდექსი და შემდეგ  ამ ინდექსზე მდგომი ელემენტი ამოშალე სიიდან. საბოლოოდ დაბეჭდე სიის საბოლოო ვერსია.

# 5) დაწერეთ ფუნქცია, რომელიც შეამოწმებს არგუმენტად გადაცემული რიცხვი მარტივია თუ არა. (მარტივია რიცხვი, თუ მას მხოლოდ ორი გამყოფი აქვს). მინიშნება: გამოიყენეთ For loop და % გამყოფი ოპერატორი.

# რესურსი:
# def func(num_list, s):
#     count = 0
#     for num in num_list:
#         if num == s:
#             count += 1
#     return count

# list = [1,1,1,1,1,2,2,4,5,6,7,2,2,8,92,45,62,7,2,76,8,2,3,76,7,26]
# print("აირჩიე რიცხვი ამ სიიდან :", list)
# usr = int(input("შეიყვანე რიცხვი: "))
# result = func(list, usr)

# print(f"რიცხვი {usr} მეორდება {result} ჯერ სიაში")

# fruits = ["apple", "bnana", "orange", "mango", "grape"]

# print(fruits)

# index = int(input("შეიყვანე ინდექსი, რომელიც გინდა წაშალო: "))

# if 0 <=len(fruits):
#     fruits.pop(index)
#     print("განახლებული სია:", fruits)
# else:
#     print("არასწორია")

def prime1():
    num = int(input("enter your number :"))
    if num < 2:
        print("the number is not prime")
    else:
        for i in range(2, num):
            if num % i == 0:
                print("the number is not prime")
                break
        else:
            print("the number is prime")

print(prime1([22]))