# 1) შექმენით manual_swapcase ფუნქცია დღეს ნასწავლი მეთოდების გამოყენებით.

# 2) ჩამოწერეთ გაკვეთილზე ახსნილი სამივე ფუნქცია და მიუწერეთ განმარტებები

# def swapp(s):
#     res=""
#     for i in s:
#         if i == i.lower():
#             res += i.upper()
#         else:
#             res += i.lower()
#     return res

# print(swapp("ASDASD"))
# print(swapp("asdasd"))
#isalpha
#ამოწმებს თუ ცვლადში ინახება სიტყვა ან ასო
#islower
#ამოწმებს თუ სთრინგი არის პატარა ასოებებით თუ არის პატარა ასოებით გამოიტანს True-ს და თუ არ არის გამოიტანს False-ს
#isupper
#ამოწმებს თუ სთრინგი არის დიდ ასოებებით თუ არის დიდი ასოებით გამოიტანს True-ს და თუ არ არის გამოიტანს False-ს